# IFCParameter Template List Names Method

Source: https://www.revitapidocs.com/2026/0fd791f7-994a-1dfb-659f-5e63de2fcee0.htm

---

| IFCParameter Template List Names Method |
| --- |

Returns a list of names of IFC export parameter mapping templates.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<string> ListNames(
	Document document
)
```

```
Public Shared Function ListNames (
	document As Document
) As IList(Of String)
```

```
public:
static IList<String^>^ ListNames(
	Document^ document
)
```

```
static member ListNames :
        document : Document -> IList<string>
```

#### Parameters

document Document
:   The Revit document to retrieve names from.

#### Return Value

IList String
The array of strings representing names of predefined setups. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace